Revit 2024 API
AreaBasedLoadData.ApparentLoad Property
 The electrical apparent load of the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public double ApparentLoad { get; }
Visual Basic
Public ReadOnly Property ApparentLoad As Double
	Get
Visual C++
public:
property double ApparentLoad {
	double get ();
}
See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace